InformationRegisters/__СостоянияСообщенийПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СостоянияСообщенийПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СообщенияПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>__СообщенияПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/__СостоянияСообщенийПользователей/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	
	// Заполнение реквизитов.
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Запись.Получено = Запись.Получено Или Запись.Прочитано;
		
		Если Не ЗначениеЗаполнено(Запись.Отправитель) Тогда
			Запись.Отправитель = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.ДатаНачалаПериода) Тогда
			Запись.ДатаНачалаПериода = ТекущаяДата;
		КонецЕсли;
		Если Запись.Прочитано Тогда
			Если Не ЗначениеЗаполнено(Запись.ДатаОкончанияПериода) Тогда
				Запись.ДатаОкончанияПериода = ТекущаяДата;
			КонецЕсли;
		Иначе
			Запись.ДатаОкончанияПериода = Неопределено;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Сообщение.
	МассивСообщений = Новый Массив; Для Каждого Запись Из ЭтотОбъект Цикл Если Не Запись.Получено Тогда МассивСообщений.Добавить(Запись.Сообщение); КонецЕсли;; КонецЦикла;
	
	// Запись связанных данных.
	Если Булево(МассивСообщений.Количество()) Тогда
		Запись = РегистрыСведений.__СообщенияПользователей.СоздатьМенеджерЗаписи(); 
		
		Для Каждого ЭлементСообщений Из МассивСообщений Цикл Запись.Сообщение = ЭлементСообщений; Запись.Записать(Истина); КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()
